// Задача : Напишите программу, которая принимает на вход пятизначное число и проверяет, 
// является ли оно палиндромом.

/*
bool Pal(int number)
{
    int num = number;
    string result = "";
    while(num > 0)
    {
        int a = num % 10; 
        num = num / 10;   
        result = result + a;
    }

    int y = int.Parse(result);

    if(y == number)
    {
        bool res = true;
        return res;
    }
    else
    {
        bool res = false;
        return res;
    }
}

Console.Write("Input a number : ");

int x = Convert.ToInt32(Console.ReadLine());
bool go = Pal(x);

Console.WriteLine(go);
*/

// Задача : Напишите программу, которая принимает на вход координаты двух точек 
// и находит расстояние между ними в 3D пространстве.








